In [1]:
import pandas as pd

In [2]:
import pandas as pf
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv','Mittal','Archana'],
      
'Marks':[98,89,99,87,90,83,99],
    'Gender':['Male','Female','Female','Male','Male','Female','Female']}
df1 =  pf.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [6]:
# Check the last 3 Rows of the dataset
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [8]:
# Find Shape of our Dataset(Number of Rows & Number of Columns)
df1.shape

(7, 3)

In [10]:
print('Number of Rows',df1.shape[0])
print('Number of Columns',df1.shape[1])

Number of Rows 7
Number of Columns 3

In [11]:
# Get information aboout our dataset like total number Rows,Total Numebr of columns,Datatypes of Each column and memeory requirement
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [14]:
# check Null in the Dataset
df1.isnull().sum(axis= 0)

Name      0
Marks     0
Gender    0
dtype: int64

In [15]:
# Get Overall Statsistics About The Dataframe
df1.describe(include = 'all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [16]:
# Find Unique Values from the gender Column
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [17]:
# Find the number of Unique Values in Gender Colmun
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [18]:
# Display Count of Unique Value in Gender Column
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

In [21]:
# Find Total Number of Student Having Marks Btewwn 90 to 100 (inclusive ) using Between Method
df1[(df1['Marks'] >=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [23]:
sum(df1['Marks'].between(90,100))

4

In [25]:
#Find Average Marks
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [29]:
df1['Marks'].mean()

92.14285714285714

In [35]:
# Apply Method
def marks(x):
    return x/4

In [37]:
df1['Quater Marks'] = df1['Marks'].apply(marks)

In [38]:
df1

      Name  Marks  Gender  Quater Marks
0  Priyang     98    Male         24.50
1   Aadhya     89  Female         22.25
2   Krisha     99  Female         24.75
3   Vedant     87    Male         21.75
4   Parshv     90    Male         22.50
5   Mittal     83  Female         20.75
6  Archana     99  Female         24.75

In [39]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [40]:
# determine length of names
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

In [41]:
# Map function
df1

      Name  Marks  Gender  Quater Marks
0  Priyang     98    Male         24.50
1   Aadhya     89  Female         22.25
2   Krisha     99  Female         24.75
3   Vedant     87    Male         21.75
4   Parshv     90    Male         22.50
5   Mittal     83  Female         20.75
6  Archana     99  Female         24.75

In [44]:
#Drop the columns
df1.drop("Quater Marks",axis =1,inplace=True)

In [43]:
df1

      Name  Marks  Gender  Quater Marks
0  Priyang     98    Male         24.50
1   Aadhya     89  Female         22.25
2   Krisha     99  Female         24.75
3   Vedant     87    Male         21.75
4   Parshv     90    Male         22.50
5   Mittal     83  Female         20.75
6  Archana     99  Female         24.75

In [45]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [46]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [47]:
# Sort the dataframe as per the Marks Column
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [52]:
df1.sort_values(by='Marks',ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [53]:
# Provide only females
df1[df1['Gender'] == 'Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99